socialNetwork/wrk2/test-run-9th-sept-1/COMMAND_19/56
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 1039.723ms, rate sampling interval: 3928ms
  Thread calibration: mean lat.: 1033.834ms, rate sampling interval: 3950ms
  Thread calibration: mean lat.: 1170.899ms, rate sampling interval: 4366ms
  Thread calibration: mean lat.: 1093.395ms, rate sampling interval: 4044ms
  Thread calibration: mean lat.: 1126.777ms, rate sampling interval: 4130ms
  Thread calibration: mean lat.: 1050.172ms, rate sampling interval: 4079ms
  Thread calibration: mean lat.: 1121.460ms, rate sampling interval: 4136ms
  Thread calibration: mean lat.: 1091.398ms, rate sampling interval: 4069ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.63s     2.66s   11.69s    57.14%
    Req/Sec    59.48     21.07   102.00     64.21%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.32s 
 75.000%    9.06s 
 90.000%   10.16s 
 99.000%   11.69s 
 99.900%   12.12s 
 99.990%   12.39s 
 99.999%   12.42s 
100.000%   12.42s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1822.719     0.000000            1         1.00
    2721.791     0.100000         2436         1.11
    4016.127     0.200000         4866         1.25
    5132.287     0.300000         7309         1.43
    5648.383     0.400000         9738         1.67
    6320.127     0.500000        12166         2.00
    6758.399     0.550000        13384         2.22
    7266.303     0.600000        14599         2.50
    8040.447     0.650000        15817         2.86
    8617.983     0.700000        17043         3.33
    9060.351     0.750000        18253         4.00
    9355.263     0.775000        18863         4.44
    9568.255     0.800000        19490         5.00
    9707.519     0.825000        20103         5.71
    9846.783     0.850000        20684         6.67
   10002.431     0.875000        21317         8.00
   10076.159     0.887500        21606         8.89
   10158.079     0.900000        21922        10.00
   10239.999     0.912500        22211        11.43
   10362.879     0.925000        22526        13.33
   10469.375     0.937500        22812        16.00
   10543.103     0.943750        22963        17.78
   10616.831     0.950000        23115        20.00
   10706.943     0.956250        23287        22.86
   10821.631     0.962500        23423        26.67
   11042.815     0.968750        23571        32.00
   11149.311     0.971875        23647        35.56
   11296.767     0.975000        23724        40.00
   11370.495     0.978125        23801        45.71
   11460.607     0.981250        23879        53.33
   11542.527     0.984375        23951        64.00
   11583.487     0.985938        23988        71.11
   11632.639     0.987500        24033        80.00
   11673.599     0.989062        24073        91.43
   11714.559     0.990625        24103       106.67
   11771.903     0.992188        24144       128.00
   11796.479     0.992969        24162       142.22
   11821.055     0.993750        24178       160.00
   11853.823     0.994531        24197       182.86
   11894.783     0.995313        24217       213.33
   11943.935     0.996094        24237       256.00
   11968.511     0.996484        24247       284.44
   11993.087     0.996875        24257       320.00
   12017.663     0.997266        24265       365.71
   12034.047     0.997656        24273       426.67
   12058.623     0.998047        24284       512.00
   12075.007     0.998242        24291       568.89
   12083.199     0.998437        24293       640.00
   12091.391     0.998633        24297       731.43
   12107.775     0.998828        24302       853.33
   12115.967     0.999023        24307      1024.00
   12132.351     0.999121        24311      1137.78
   12132.351     0.999219        24311      1280.00
   12148.735     0.999316        24314      1462.86
   12173.311     0.999414        24317      1706.67
   12238.847     0.999512        24319      2048.00
   12255.231     0.999561        24320      2275.56
   12263.423     0.999609        24321      2560.00
   12271.615     0.999658        24322      2925.71
   12296.191     0.999707        24323      3413.33
   12337.151     0.999756        24325      4096.00
   12337.151     0.999780        24325      4551.11
   12353.535     0.999805        24326      5120.00
   12353.535     0.999829        24326      5851.43
   12369.919     0.999854        24327      6826.67
   12386.303     0.999878        24328      8192.00
   12386.303     0.999890        24328      9102.22
   12386.303     0.999902        24328     10240.00
   12386.303     0.999915        24328     11702.86
   12402.687     0.999927        24329     13653.33
   12402.687     0.999939        24329     16384.00
   12402.687     0.999945        24329     18204.44
   12402.687     0.999951        24329     20480.00
   12402.687     0.999957        24329     23405.71
   12419.071     0.999963        24330     27306.67
   12419.071     1.000000        24330          inf
#[Mean    =     6631.242, StdDeviation   =     2664.424]
#[Max     =    12410.880, Total count    =        24330]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  32210 requests in 1.00m, 6.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 39
Requests/sec:    536.78
Transfer/sec:    112.70KB